diroik/STM32WS/MKAB_STM32Lxx/src/Classes.cpp
//=============================================================================
#include <Classes.h>
#include <flash_map.h>
#include <stm32l1xx_flash.h>
#include <stm32l1xx_rcc.h>
#include <stm32l1xx_usart.h>
//=============================================================================
//*****************************************************************************
//*** Class TObject
//*****************************************************************************
//=============================================================================
//  
//=======================================
TRtcTime  *TObject::GetRtcTime( string &date, string &time )
{
  CLEAR_WDT;
  Tlist<string> tmpvect;   
  TRtcTime *DateTime = new TRtcTime();
  TBuffer::Split(date,".",tmpvect);
  if(tmpvect.size() == 3)
  {
    DateTime->Day    = atoi(tmpvect[0].c_str());
    DateTime->Month  = atoi(tmpvect[1].c_str());
    DateTime->Year   = atoi(tmpvect[2].c_str());
  }
  else 
  { return NULL;}
  tmpvect.clear(); 
  TBuffer::Split(time,":",tmpvect);
  if(tmpvect.size() == 3)
  {
    DateTime->Hour     = atoi(tmpvect[0].c_str());
    DateTime->Minute   = atoi(tmpvect[1].c_str());
    DateTime->Second   = atoi(tmpvect[2].c_str());  
  }
  else
  { return NULL;}
  return DateTime;
}  
//=============================================================================
//  
//=======================================
void  TObject::SetDataTime(TDateTime &dt, string &date, string &time)
{
  //static bool flg = false;
  CLEAR_WDT;
  Tlist<string> tmpvect;   
  TRtcTime DateTime;
  TBuffer::Split(date,".", tmpvect);
  if(tmpvect.size() != 3)
  {
    return;
  }
  DateTime.Day    = atoi(tmpvect[0].c_str());
  DateTime.Month  = atoi(tmpvect[1].c_str());
  DateTime.Year   = atoi(tmpvect[2].c_str());
  tmpvect.clear(); 
  TBuffer::Split(time,":",tmpvect);
  if(tmpvect.size() != 3){ return;}
  DateTime.Hour     = atoi(tmpvect[0].c_str());
  DateTime.Minute   = atoi(tmpvect[1].c_str());
  DateTime.Second   = atoi(tmpvect[2].c_str());  
  
  long CurrGloalSeconds   = dt.DateTime.Hour*3600L + dt.DateTime.Minute*60L + dt.DateTime.Second*1L;
  long NewGlobalSeconds   = DateTime.Hour*3600L + DateTime.Minute*60L + DateTime.Second*1L;
  
  long div = labs(NewGlobalSeconds - CurrGloalSeconds);
  if( div > 1)//если разница больша€ - пр€ма€ запись значений времени
  {
    RtcTimerDivider = 32767;
    Init_SysTick(RtcTimerDivider);//сброс таймер-счетчика
    //Init_TIMER_A0(RtcTimerDivider);//сброс таймер-счетчика
    dt.SetTime(DateTime);//установка нового времени
  }
  else if(div == 1)// если разбежалось на секунду
  {
    //flg = true;
    if(NewGlobalSeconds > CurrGloalSeconds)//отстаЄм, нужно быстрее
    { 
      /*if(flg == false)
      {
        RtcTimerDivider -=1;
        flg = true;
      }*/
      Init_SysTick(2);//программно подводим часы чтоб секунда сработала быстрее
      //Init_TIMER_A0(2);//программно подводим часы чтоб секунда сработала быстрее
    }
    else//спешим
    { 
      /*if(flg == false)
      {
        RtcTimerDivider +=1;
        flg = true;
      }*/
      Init_SysTick(RtcTimerDivider+16384);// чтоб секунда сработала медленнее 
      //Init_TIMER_A0(RtcTimerDivider+16384);// чтоб секунда сработала медленнее 
    }
  }
  //else//все ок
  //{ flg = false;}
}
//=============================================================================
// «апись в пам€ть констант  
//=======================================
bool TObject::Save_ParamsInInfo(Data_Params  *Params)
{
//ѕерезапись всей страницы с временным(защитным) хранилищем в другой странице 
 Word         Len;
 Byte        *Tmp                  = (Byte *)Params;  //вз€ли указатель 
  
  Len = sizeof(*Params); 
  for(Word i=0; i<3; i++)
  {
    WriteEepromBufToPage((Byte const*)&TMP_PARAMS, Tmp, Len-1 );  //записали во временную(защитную) пам€ть
    WriteEepromBufToPage((Byte const*)&PARAMS    , Tmp, Len-1 );  //записали куда надо
  
    if(VerifyMemory((Byte const*)&PARAMS,Tmp, Len))
    {//удалили временную запись 
      ClrEepromFlashSegment( (Byte const*)&TMP_PARAMS );
      return true; 
    }
    else
    { continue;}
  }
  return false;
}
//=============================================================================
//  
//=======================================
bool TObject::VerifyMemory(Byte const* DestAddr, Byte* ScrAddr,Word Len)
{
  for(Word i=0; i<Len; i++)
  {
    CLEAR_WDT;
    if(DestAddr[i]!=ScrAddr[i])
    { return false;}
  }
  return true; 
}
//=============================================================================
//  
//=======================================
bool TObject::RestoreMemParams(void)
{
 Word         Len;
 Data_Params  TmpParam            = *PtrToConstants;    //сохранили текущие значени€ параметров в оперативке
 Byte        *Tmp                 = (Byte *)&TmpParam;  //вз€ли указатель 
  
  Len = sizeof(TmpParam);
  
  for(Word i = 0;i<3;i++)
  {
    CLEAR_WDT;
    WriteEepromBufToPage((Byte const*)&PARAMS    , Tmp, Len-1 );  //записали куда надо
    if(VerifyMemory((Byte const*)&PARAMS,Tmp, Len))
    {//удалили временную запись 
      ClrEepromFlashSegment( (Byte const*)&TMP_PARAMS );
      return true; 
    }
    else
    { 
      continue;
    }
  }
  return false;  
}
//=============================================================================
//  
//=======================================
void TObject::RestoreDefault(void)
{
  Word         Len;
  Data_Params  TmpParam;
  Byte        *Tmp             = (Byte *)&TmpParam;  //вз€ли указатель 
  Byte        Addr[]           = "11";
  Byte        PassWord[]       = "TM_DP485";
  Byte        Unit_Type[]      = "MKAB-12";
  Word        i;
 
  CLEAR_WDT;
  for(i=0;i<sizeof(Addr);i++)       { TmpParam.DevAddress[i]=Addr[i];} 
  for(i=0;i<sizeof(PassWord);i++)   { TmpParam.PassWord[i]=PassWord[i];}               
  for(i=0;i<sizeof(Unit_Type);i++)  { TmpParam.Unit_Type[i]=Unit_Type[i];}  

  TmpParam.MAIN_BOUD_RATE     = 38400;
  TmpParam.MAIN_timeout       = 500;
  
  TmpParam.wReserved[0]       = 26; // et
  TmpParam.wReserved[1]       = 1;  // en
  TmpParam.wReserved[2]       = 1;  // pn
  
