diroik/STM32WS/MKAB_STM32Lxx/src/Classes.cpp
    //HOLD_WDT;
    while (len--)
    { 
      CLEAR_WDT;
      crc = (crc >> 8) ^ Crc16Table[(crc & 0xFF) ^ *pcBlock++];
    }
    return crc;
}
//=============================================================================
// 
//=======================================
Word TBuffer::Crc(Byte const * pcBlock, Word len)
{
  Word crc = 0;

    while (len--)
    { 
      crc += *pcBlock++;
      CLEAR_WDT;      
    }
    return crc;  
}
//=============================================================================
// 
//=======================================
void TBuffer::XOR_Crypt(Byte* in, Word inlen, string pass)
{
  for ( Word x = 0; x < inlen; x++)
  {
      in[x] = (Byte)( in[x] ^ pass[x%pass.length()] );
      CLEAR_WDT;
  }
}
//=============================================================================
// 
//=======================================
DWord TBuffer::ByteToLong(Byte* Buf)
{
  Blong   LBuf;
    for (Word i = 0; i < 4 ; i++)
      LBuf.Data_b[i] = Buf[i];
    return LBuf.Data_l;
}
//=============================================================================
//
//=======================================
Word TBuffer::ByteToShort(Byte* Buf)
{
 Bshort  SBuf;

 for (Word i = 0; i < 2 ; i++)
	 SBuf.Data_b[i] = Buf[i];
 return SBuf.Data_s;
}
//=============================================================================
//
//=======================================
Word TBuffer::DeByteToShort(Byte* Buf)
{
 Bshort  SBuf;

 for (Word i = 0; i < 2 ; i++)
	 SBuf.Data_b[1-i] = Buf[i];
 return SBuf.Data_s;
}
//=============================================================================
//
//=======================================
void   TBuffer::ClrBUF(Byte *BUF, Word Len)
{
  for (Word i=0;i<Len;i++)
  {
    CLEAR_WDT;
    BUF[i] = 0;
  }
}
//=============================================================================
//
//=======================================
bool   TBuffer::StrCmp(Byte const* Str1, Byte const* Str2)
{
  while(*Str1)
  {
    CLEAR_WDT;
    if(*Str1++ != *Str2++)
    {  return false;}
  }
  if(*Str2 != 0)
  {  return false;}
  return true;
}
//=============================================================================
//
//=======================================
Word TBuffer::HexToWord(Byte *ptr)
{
    //Word number = 0;
  while(*ptr < 0x20) ptr++;
  
  Bshort number;
  number.Data_b[1] =  HexToByte(ptr); 
  ptr+=2;
  number.Data_b[0] =  HexToByte(ptr); 
      
    
  //HexToByte(HEX, (Byte)( WORD >> 8) );
  //HexToByte(&HEX[2], (Byte)( WORD) );
    
  //sscanf((char*)ptr, "%X", &number);
  //return number;
  
  return number.Data_s;
}
//=============================================================================
//
//=======================================
/*
DWord TBuffer::HexToDWord(Byte *Ptr)
{
  DWord number = 0;
    
  sscanf((char*)Ptr, "%lX", &number);
  return number;
}*/
//=============================================================================
//
//=======================================
sWord TBuffer::HexToByte(Byte *ptr)
{
   Byte ch  = *ptr++;
   Byte k   = 0;      
   Byte result[2] = {0,0};  

  while(k < 2)
  { 
    CLEAR_WDT;
    if( (ch >= 'A') && (ch <= 'F') ) 
    {  result[k] = (ch - 'A') + 10; } 
    else if( (ch >= '0') && (ch <= '9') ) 
    {  result[k] = ch - '0';} 
    else
    {  return -1;}
    ch = *ptr++;   
    k++;
  }
  return (result[0] <<= 4) + result[1];
}
//=============================================================================
//
//=======================================
void TBuffer::ByteToHex(Byte *HEX, Byte BYTE)
{
 Byte ch = (BYTE >> 4) & 0x0F;
 Byte k  = 0;
  
   while(k < 2)
   {
     CLEAR_WDT;
     if(ch > 9)
     {  *HEX++ = ch + 'A' - 10;}  
     else 
     {  *HEX++ = ch + '0';}
  
     ch = BYTE & 0x0F;
     k++;
   }
   HEX = NULL;
}
//=============================================================================
//
//=======================================
void TBuffer::WordToHex(Byte *HEX, Word WORD)
{
  ByteToHex(HEX, (Byte)( WORD >> 8) );
  ByteToHex(&HEX[2], (Byte)( WORD) );
}
//=============================================================================
//
//=======================================
void TBuffer::DWordToHex(Byte *HEX, DWord DWORD)
{
  WordToHex(HEX, (Word)( DWORD >> 16) );
  WordToHex(&HEX[4], (Word)( DWORD) );
}
//=============================================================================
//
//=======================================
Word TBuffer::CopyString(Byte* DestStr, Byte* SrcStr)
{
  Word len = 0;
  
  while(*SrcStr)
  {
    *DestStr++ = *SrcStr++;
    len++;
    CLEAR_WDT;    
  }

  *DestStr = 0;
  return len;
}       
//=============================================================================
//
//=======================================
/*Byte TBuffer::FloatToString(Byte *ReturnBUF, float Val, Byte AllSymb, Byte AfteComma)
{
  Word begin_val = (Word)Val;
  Word after_val = (Word)((Val - begin_val) * pow(10.0,AfteComma)) ;
  
  Word val;
  
  Val = (Val - begin_val);
  
  for (Byte i= 1;AllSymb+1>i;i++)
    {
      Word mult = (Word)pow(10.0, (AllSymb-i));
      val = begin_val/mult + 0x30;
      begin_val = begin_val%mult;
      ReturnBUF[i-1] = (Byte)val;
    }
  
  ReturnBUF[AllSymb] = 0x2E;
  
  for (Byte j= 1;AfteComma+1>j;j++)
    {
    Word mult = (Word)pow(10.0,(AfteComma -j));
    val = after_val/mult + 0x30;
    after_val = after_val%mult;
    ReturnBUF[AllSymb + j] = (Byte)val;
    }

//  sprintf((char*)ReturnBUF,"%0*.*f",AllSymb,AfteComma,Val);
  return AllSymb;
}*/
//=============================================================================
//
//=======================================
//#pragma optimize=z none
string TBuffer::FloatToString(float Val, Byte AllSymb, Byte AfteComma)
{
  Word begin_val = (Word)Val;
  Word after_val = (Word)( (Val - begin_val) * pow(10.0, AfteComma) );
 
  return IntToString(begin_val) + "." + IntToString(after_val, AfteComma);
}
//=============================================================================
//
//=======================================
string TBuffer::IntToString(int Val, Byte AllSymb)
{
  if(Val == 0 && AllSymb == 0)
    return "0";
  char buff[16] ={0};
  if(AllSymb == 0)
  { 
    while(Val >=  (Word)pow(10.0, AllSymb))
      AllSymb++;
  }
  
  for (Byte i= 1;AllSymb+1>i;i++)
  {
      Word mult = (Word)pow(10.0, (AllSymb-i));
      Word val = Val/mult + 0x30;
      Val = Val%mult;
      buff[i-1] = (Byte)val;
  }
  return string(buff);
}
//=============================================================================
//
//=======================================
//#pragma optimize=z none
string TBuffer::LongToString(long Val, Byte AllSymb)
{
  if(Val == 0 && AllSymb == 0)
    return "0";
  char buff[32] ={0};
  if(AllSymb == 0)
  { 
    while(Val >=  pow(10.0, AllSymb))
      AllSymb++;
  }
  
  for (Byte i= 1;AllSymb+1>i;i++)
  {
      long mult = (long)pow(10.0, (AllSymb-i));
      long val = Val/mult + 0x30;
      Val = Val%mult;
      buff[i-1] = (Byte)val;
  }
  return string(buff);
}
/*
//=============================================================================
//
//=======================================
Word TBuffer::NewStringToInt(string Val)
{
string some_string;
istringstream buffer(Val);
Word some_int;
buffer >> some_int;
return some_int;
}

