diroik/STM32WS/MKAB_STM32Lxx/src/Classes.cpp
//=============================================================================
//
//=======================================
string TBuffer::NewIntToString(int Val)
{
    ostringstream buffer;
    buffer << Val;
    return buffer.str();
}*/
//=============================================================================
//
//=======================================
string TBuffer::WordToString(Word Val, Byte AllSymb)
{
  char buff[6] = {0x30,0x30,0x30,0x30,0x30,0};
  sByte index = 4;
  Word counter = 1;
  Word tmpcounter = 1;
  Word tmp1;
  Word tmp2;
  
  do
  {
    counter*=10;
    tmp1 = Val/counter;
    tmp2 = Val%counter;
    tmp2 = tmp2/tmpcounter;
    tmpcounter = counter;
    buff[index--] = tmp2+0x30;
  }
  while(tmp1 > 0 && index > 0);
  if(tmp1 > 0)
  { buff[index--] = tmp1+0x30;}
  if(AllSymb > 0)
  {
    sByte i = index+1;
    if(i > 0)
    {
      if(AllSymb > 5) 
      { AllSymb = 5;}
      Byte siz = 5-i;
      i=AllSymb-siz;
      if(i>0)
      {
        index-=i;
      }
    }
  }
  return string(&buff[index+1]);
}
//=============================================================================
//
//=======================================
string TBuffer::DateTimeToString(TRtcTime *datetime)
{
  return  string(
          TBuffer::WordToString(datetime->Day)+'.'+
          TBuffer::WordToString(datetime->Month)+'.'+ 
          TBuffer::WordToString(datetime->Year)+','+
          TBuffer::WordToString(datetime->Hour)+':'+ 
          TBuffer::WordToString(datetime->Minute)+':'+  
          TBuffer::WordToString(datetime->Second) 
                );
  
}
//=============================================================================
//
//=======================================
TRtcTime *TBuffer::StringToDateTime(string strdt)
{
 Tlist<string> results;
  
  TBuffer::Split(strdt, "," , results);
  if(results.size() != 2){ return NULL;}
  string date = results[0];
  string time = results[1];
  
  results.clear();
  TBuffer::Split(date, "." , results);
  if(results.size() != 3){ return NULL;}
  
  TRtcTime dt;
  dt.Day    = atoi( results[0].c_str() );
  dt.Month  = atoi( results[1].c_str() );
  dt.Year   = atoi( results[2].c_str() );
  
  results.clear();
  TBuffer::Split(time, ":" , results);
  if(results.size() != 3){ return NULL;}  
  dt.Hour    = atoi( results[0].c_str() );
  dt.Minute  = atoi( results[1].c_str() );
  dt.Second  = atoi( results[2].c_str() );
  
  TRtcTime *rdt = new TRtcTime();
  *rdt = dt;
  return rdt;
}
//=============================================================================
//
//=======================================
void  TBuffer::Split(string &str, string separator, Tlist<string> &results, int Len)
{
    int found = (int)str.find(separator);
    while(found > -1)
    {
        if(found > 0)
        { 
          results.push_back(str.substr(0, found));
          if(Len > 0 && results.size()>= Len)
            return;
        }
        str = str.substr(found+separator.size(), -1);//-1==npos!!!
        found = (int)str.find(separator);
    }
    /*
    while(found != std::string::npos)
    {
      CLEAR_WDT;
        if(found > 0)
        { 
          results.push_back(str.substr(0,found));
          if(Len > 0 && results.size()>= Len)
          { return;}
        }
        str = str.substr(found+separator.size());
        found = str.find(separator);
    }*/
    
    if(str.length() > 0)
      results.push_back(str);
}
//=============================================================================
//
//=======================================
void  TBuffer::Split(Byte *BUFFER, Word Size, string separator, Tlist<string> &results, Word Len)
{
    int found;
    found = TBuffer::find(BUFFER, Size, separator);
    while( found != -1 && Size > 0)
    {
      CLEAR_WDT;
        if(found > 0)
        { 
          string tmp = string((char*)BUFFER, found );
          results.push_back( tmp );
          if(Len > 0 && results.size()>= Len)
          { return;}
        }
        BUFFER = (Byte*)( (DWord)BUFFER+found+separator.size() );
        Size = Size - (found+separator.size());
        found = TBuffer::find(BUFFER, Size, separator);
    }
    if(Size > 0)
    { results.push_back( string((char*)BUFFER, Size ) );}
}
//=============================================================================
//
//=======================================
int  TBuffer::find_first_of(TBuffer *BUFFER, Byte simb)
{
  int returnVal = -1;
  for(int i=0; i < BUFFER->DataLen; i++)
  {
    CLEAR_WDT;
    if(BUFFER->BUF[i] == simb)
    {
      returnVal = i;
      break;
    }
  }
return returnVal;
}
//=============================================================================
//
//=======================================
int  TBuffer::find_first_of(Byte *BUFFER, Word Len, Byte simb)
{
  int returnVal = -1;
  for(int i=0; i < Len; i++)
  {
    CLEAR_WDT;
    if(BUFFER[i] == simb)
    {
      returnVal = i;
      break;
    }
  }
return returnVal;
}
//=============================================================================
//
//=======================================
int  TBuffer::find(TBuffer *BUFFER, string str)
{
  int returnVal = -1;
  Byte simb = str.c_str()[0];
  for(int i=0; i < BUFFER->DataLen; i++)
  {
    CLEAR_WDT;
    if(BUFFER->BUF[i] == simb)
    {
      string tmp = string( (char*)&BUFFER->BUF[i], str.size() );
      if(tmp == str)
      { 
        returnVal = i;
        break;
      }
    }
  }
return returnVal;
}
//=============================================================================
//
//=======================================
int  TBuffer::find(Byte *BUFFER, Word Len, string str)
{
  int returnVal = -1;
  Byte simb = str.c_str()[0];
  for(int i=0; i < Len; i++)
  {
    CLEAR_WDT;
    if(BUFFER[i] == simb)
    {
      string tmp = string( (char*)&BUFFER[i], str.size() );
      if(tmp == str)
      { 
        returnVal = i;
        break;
      }
    }
  }
return returnVal;
}
//=============================================================================
//
//=======================================
int  TBuffer::find_last_of(TBuffer *BUFFER, Byte simb)
{
  int returnVal = -1;
  for(int i=(BUFFER->DataLen-1); i > 0; i--)
  {
    CLEAR_WDT;
    if(BUFFER->BUF[i] == simb)
    {
      returnVal = i;
      break;
    }
  }
return returnVal;
}
//=============================================================================
//
//=======================================
Word TBuffer::clear_all_nulls(char *_ptr, Word _size)
{
        //HOLD_WDT;
        char *ptrDst;
        char *ptrSrc;
        for(int i = 0; i <= _size; i++)
        {
          CLEAR_WDT;
          ptrDst = &_ptr[i];
          if( *ptrDst < ' ')
          {
            ptrSrc = &_ptr[i+1]; 
            int rsz = (_size-i);
            for(int j = 0; j < rsz; j++)
            {
              CLEAR_WDT;
              ptrDst[j] = ptrSrc[j];
            }
            if(rsz > 0)
            {
              _size--;
              i--;
            }
          }
        }
        _ptr[_size] = 0;
        return _size;
}
//*****************************************************************************
//*** ObjectFunctionsTimer
//*****************************************************************************
TFastTimer TObjectFunctions::ObjectFunctionsTimer(2,&SecCount);  
//*****************************************************************************
//*** Class TObjectFunctions
//*****************************************************************************
void TObjectFunctions::ReleON(int rele)
{
         Word index = (Word)rele;
         if(index > 0) {index--;} 
         //ObjectFunctionsTimer.SetTimer(index, RELE_OFF_TIM_VAL);
         index  = 1 - index;
         
          //P9DIR |= 1 << index;
          //P9OUT |= 1 << index;
}
//=============================================================================
//  
//=======================================
void TObjectFunctions::ReleOFF(int rele)
{
         Word index = (Word)rele;
          if(index > 0) {index--;} 
          index  = 1 - index;
          
          //P9DIR |= 1 << index;
          //P9OUT &= ~(1 << index);
}
//*****************************************************************************
//***TDateTime
//*****************************************************************************
//=============================================================================
// 
//=======================================
TDateTime::TDateTime() 
{
    TRtcTime time;
      time.Year  = 2010; 	
      time.Month = 1;
      time.Day   = 1;
      time.Hour  = 0;
      time.Minute= 0;
      time.Second= 1;
      GlobalSeconds = 1;
    SetTime(time);
    TimeSynchIsActual=false;
}  
//=============================================================================
// 
//=======================================
TDateTime::TDateTime(TRtcTime time)
{ 
    SetTime(time);
}
//=============================================================================
// 
//=======================================
void TDateTime::SetSynchAct(void)
{
      TimeSynchIsActual=true;
}
//=============================================================================
// 
//=======================================
bool TDateTime::GetSynchAct(void)
{
      return TimeSynchIsActual;
}
//=============================================================================
// 
//=======================================
TDateTime::~TDateTime()
{}
//=============================================================================
// 
//=======================================  
TRtcTime TDateTime::GetTime(void)
{
      return DateTime;
}
//=============================================================================
// 
//=======================================    
void TDateTime::SetTime(TRtcTime dateTime)
{
      DateTime      = dateTime;
      GlobalSeconds = DateTime.Hour*3600L+DateTime.Minute*60L+DateTime.Second;
}
//=============================================================================
// 
//=======================================    
void TDateTime::IncSecond(void)
{
    if(++DateTime.Second >= 60)
    {
      DateTime.Second = 0;
      IncMinute();
    }
    if(GlobalSeconds++ > 86400L)//ограничили макс-значение
    {
      GlobalSeconds = DateTime.Hour*3600L+DateTime.Minute*60L+DateTime.Second;
    }
}
//=============================================================================
// 
//=======================================    
DWord TDateTime::GetGlobalSeconds(void)
{ 
  return GlobalSeconds;
}

