diroik/STM32WS/MKAB_STM32Lxx/src/Classes.cpp
//=============================================================================
// 
//=======================================    
long TDateTime::GetFullGlobalSecond(void)
{ 
  
  return long(GlobalSeconds+(long)((2010-DateTime.Year)*8760+(DateTime.Month*730)+(DateTime.Day*24))*3600);
}

//=============================================================================
// 
//=======================================     
void TDateTime::IncMinute(void)
{
    if(++DateTime.Minute >= 60)
    {
      DateTime.Minute = 0;
      IncHour();
    }
}
//=============================================================================
// 
//=======================================   
void TDateTime::IncHour(void)
{
    if(++DateTime.Hour >= 24)
    {
      DateTime.Hour = 0;
      IncDay();
    }
}
//=============================================================================
// 
//=======================================    
void TDateTime::IncDay(void)
{
   Byte DaysInMonth = 31;
    if(DateTime.Month == 4 || DateTime.Month == 6 || DateTime.Month == 9 || DateTime.Month == 11 )
    { DaysInMonth = 30;}
    else if( DateTime.Month == 2)
    {
      if(IsLeapYear( DateTime.Year ) == true)
      { DaysInMonth = 29;}
      else
      { DaysInMonth = 28;}
    }    
    if(++DateTime.Day > DaysInMonth)
    {
      DateTime.Day = 1;
      IncMonth();
    }
}
//=============================================================================
// 
//=======================================  
void TDateTime::IncMonth(void)
{
    if(++DateTime.Month > 12)
    {
      DateTime.Month = 1;
      DateTime.Year++;
    }
}  
//=============================================================================
// 
//=======================================  
bool TDateTime::IsLeapYear(Word Year) 
{
    // ѕроверка високосного года
    if( (Year%4 == 0) && ((Year % 100 != 0) || (Year % 400 == 0)) )
    {  return true;} // високосный
    else
    {  return false;} //не високосный
}
//*****************************************************************************
//*****************************************************************************
//*** Class TComPort
//*****************************************************************************
TComPort::TComPort():enabled(false),TTimer(4),commPortHandle(INVALID_HANDLE_VALUE),ByteIndex(0),time_outs(),CRC_SUM(0),StxFlag(false),DataReceiving(false)
{
  DATA_Rx = NULL;
}
//=============================================================================
// Destructor
//=======================================
TComPort::~TComPort()
{
	if (commPortHandle != INVALID_HANDLE_VALUE)
	{	CloseHandle(commPortHandle);}
}
//=============================================================================
//
//=======================================
void TComPort::PushByteToDATA_Rx(Byte Data)
{
  if(DATA_Rx!=NULL)
  {
    DATA_Rx->push(Data);
  }
}
//=============================================================================
//
//=======================================
sWord TComPort::PopByteDATA_Rx(void)
{
  if(DATA_Rx!=NULL)
  { return DATA_Rx->pop();}
  else
  { return -1;}
}
//=============================================================================
// Closes the com port 
//=======================================
bool TComPort::close()
{
	if (commPortHandle != INVALID_HANDLE_VALUE)
	{	CloseHandle(commPortHandle);}
	commPortHandle = INVALID_HANDLE_VALUE;
	return true;
}
//=============================================================================
// Closes the com port Handle
//=======================================
bool TComPort::CloseHandle(HANDLE commPort)
{
  bool flag     = false;
  //Word old_SR   = __get_SR_register();
  //if(old_SR & GIE)
  {flag = true;}
  __disable_interrupt(); 
      switch (commPort)
      {
          case COM0:
              //close_UART0();
              break;
          
          case COM1:
         //     close_UART1();
              break;
          
          default:
              return false;
      } 
  enabled = false;   
  if(flag)
  {__enable_interrupt();}
  return true;
}
//=============================================================================
//=======================================
void TComPort::ClrByteIndex(void)
{
  ByteIndex = 0;
}
//=============================================================================
//=======================================
void TComPort::SetTimeOuts(COMMTIMEOUTS timeouts)
{
  time_outs = timeouts;
}
//=============================================================================
//=======================================        
void TComPort::GetTimeOuts(COMMTIMEOUTS &timeouts)
{
  timeouts = time_outs; 
}
//=============================================================================
// open com port 
//=======================================
HANDLE TComPort::open(Port port, DWord baudRate, DWord ReadIntervalTimeout)
{
  USART_InitTypeDef USART_InitStructure;
  GPIO_InitTypeDef GPIO_InitStructure;
  COMMTIMEOUTS timeouts;
      switch (port)
      {
        case COM0: 
            /* Enable GPIO clock */
          RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA, ENABLE);
          
            /* Enable USART clock */
          RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);
          
            /* Connect PXx to USARTx_Tx */
          GPIO_PinAFConfig(GPIOA, GPIO_PinSource9, GPIO_AF_USART1);
  
            /* Connect PXx to USARTx_Rx */
          GPIO_PinAFConfig(GPIOA, GPIO_PinSource10, GPIO_AF_USART1);
          
          /* Configure USART Tx and Rx as alternate function push-pull */
          GPIO_InitStructure.GPIO_Mode          = GPIO_Mode_AF;
          GPIO_InitStructure.GPIO_Speed         = GPIO_Speed_40MHz;
          GPIO_InitStructure.GPIO_OType         = GPIO_OType_PP;
          GPIO_InitStructure.GPIO_PuPd          = GPIO_PuPd_UP;
          GPIO_InitStructure.GPIO_Pin           = GPIO_Pin_9;
          GPIO_Init(GPIOA,        &GPIO_InitStructure);
          
          GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
          GPIO_Init(GPIOA, &GPIO_InitStructure);
          
          USART_InitStructure.USART_BaudRate                   = baudRate;
          USART_InitStructure.USART_WordLength                  = USART_WordLength_8b;
          USART_InitStructure.USART_StopBits                    = USART_StopBits_1;
          USART_InitStructure.USART_Parity                      = USART_Parity_No;
          USART_InitStructure.USART_HardwareFlowControl         = USART_HardwareFlowControl_None;
          USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
          USART_Init(USART1, &USART_InitStructure);
          
          RX_BUF = (Byte*)&USART1->DR;
          TX_BUF = (Byte*)&USART1->DR;
          
          USART1->CR1 |= USART_CR1_RXNEIE;
          NVIC_EnableIRQ(USART1_IRQn);   
          USART_Cmd(USART1, ENABLE);
        break;  

          default:
            __enable_interrupt();
              return INVALID_HANDLE_VALUE;
      }; 

      InitPort(baudRate);   
      enabled                         = true;    
      commPortHandle                  = (HANDLE)port;
      timeouts.ReadIntervalTimeout    = ReadIntervalTimeout;
      timeouts.ReadTotalTimeout       = timeouts.ReadIntervalTimeout*timeouts.ReadTotalTimeoutMultiplier;
      SetTimeOuts(timeouts); 

  return commPortHandle; 
}
//=============================================================================
// читаем байт
//=======================================
bool TComPort::RecvByte(Byte *data)
{
  if ( this->DATA_Rx == NULL || this->DATA_Rx->empty() )
  {  return false;}
  else
  {
    *data = this->DATA_Rx->pop();
    this->SetTimer(RX_BYTE_TIMEOUT, time_outs.ReadIntervalTimeout);//брос межбайтового таймаута
    return true;
  }   
}
//=============================================================================
// пишем байт
//=======================================
bool TComPort::SendByte(Byte data)
{    
       
       if ( GetTxIntFlag() )
       {
          this->SetTxIntEnable(true);
          //TTimer::wait_1ms(10);
          //this->DATA_Tx = data;
          USART1->DR = data;
          
          
