diroik/STM32WS/MKAB_STM32Lxx/src/Classes.cpp
        //HOLD_WDT;
	for (i = 0; i < cnt; i++)
        { 
          CLEAR_WDT;
//          __delay_cycles(14745);
        }
        CLEAR_WDT;
}
//=============================================================================
// 
//=======================================
void TTimer::wait_1us(Word cnt)
{
        // HOLD_WDT;
	for (Word i = 0; i < cnt; i++)
        { 
          CLEAR_WDT;
          //__delay_cycles(8);
          //__delay_cycles(8);//Ѕыло 8 но после добавлени€ CLEAR_WDT; 500 мс превратилось в 610...
          //__delay_cycles(9);
        }
        CLEAR_WDT;
}


//*****************************************************************************
//***TCmd
//*****************************************************************************
//=============================================================================
Word TCmd::GetAddress()          
{
  return  atoi( (char*)TObject::PtrToConstants->DevAddress );
}
//*****************************************************************************
//***TDatchik
//*****************************************************************************
TDatchik::TDatchik(TPtype* ptype, TInput* pDryInput, Byte pPrPlace)
{
    this->Ptype     = ptype;
    this->DryInput  = pDryInput;    
    this->PrPlace   = pPrPlace;      
    this->Inversia  = 0;
    this->Value     = 0;     
    this->HValue    = 0;      
    this->StopWathSendOFF = 0;
}
//=============================================================================
TDatchik::TDatchik(TPtype* ptype, TInput* pDryInput, Byte pPrPlace, bool inv, bool StopWath)
{
    this->Ptype     = ptype;
    this->DryInput  = pDryInput;    
    this->PrPlace   = pPrPlace;      
    this->Inversia  = inv;
    this->Value     = 0;     
    this->HValue    = 0;      
    this->StopWathSendOFF = StopWath;
}

//=============================================================================
TDatchik::~TDatchik()
{
  if(DryInput !=NULL)
  { delete DryInput;}
}
//=============================================================================
string TDatchik::GetStringValue(void)
{ 
  return TBuffer::WordToString(GetValue());
}
//=============================================================================
string TDatchik::GetStringCfgValue(void)
{ 
     string ReturnString = "";
     return ReturnString;
}
//=============================================================================
void   TDatchik::SetManualState(bool Ena,bool Inv)
{
    StopWathSendOFF=Ena;
    Inversia=Inv;
}
//=============================================================================
Byte TDatchik::GetValue(void)
{
     this->Value = 0;
     if(this->DryInput !=NULL)
     {  
       if(!this->StopWathSendOFF)
         this->Value = this->DryInput->GetValue();
       else
         this->Value = 1; 
     }
     return  this->Value^this->Inversia; 
}
//=============================================================================   
   void  TDatchik::SetOffInput(void)
   {
     if(this->DryInput !=NULL)
     {  
       this->StopWathSendOFF=true;
     }
   }
//=============================================================================   
   void  TDatchik::SetONInput(void)
   {
     if(this->DryInput !=NULL)
     {  
       this->StopWathSendOFF=false;
     }     
   }  
//*****************************************************************************
//***TAutomatDevice
//*****************************************************************************
TAutomatDevice::TAutomatDevice(TPtype* ptype, Byte pn, TMkkoInput **glInp, Byte ia, Byte ib, Byte ic, Byte oa, Byte ob, Byte oc):Value(0), HValue(0),_parName(pn)
{//type=ia,in=ib,outstate=ic,parentname=pn
  Byte maxSize = 43;  
  _type = 0;
  _outState = 0;
  if(ptype->PType == 5 || ptype->PType == 6)
  {

    if(ia == 0){ _inA = NULL;}
    else
    { 
      if(ia >= maxSize) ia = maxSize;
      _inA = glInp[--ia];      
    }
    ////////
    if(ib == 0){ _inB = NULL;}
    else
    { 
      if(ib >= maxSize) ib = maxSize;
      _inB = glInp[--ib];      
    }
    ////////
    if(ic == 0){ _inC = NULL;}
    else
    { 
      if(ic >= maxSize) ic = maxSize;
      _inC = glInp[--ic];      
    }
    ///////
    if(oa == 0){ _outA = NULL;}
    else
    { 
      if(oa >= maxSize) oa = maxSize;
      _outA = glInp[--oa];      
    }
    ////////
    if(ob == 0){ _outB = NULL;}
    else
    { 
      if(ob >= maxSize) ob = maxSize;
      _outB = glInp[--ob];      
    }
    ////////
    if(oc == 0){ _outC = NULL;}
    else
    { 
      if(oc >= maxSize) oc = maxSize;
      _outC = glInp[--oc];      
    }
    if(_inA != NULL) _type++;
    if(_inB != NULL) _type++;
    if(_inC != NULL) _type++;
  }
  else if(ptype->PType == 7)
  {
    _type = ia;
    if(ib >= maxSize) ib = maxSize;
    _inB = glInp[--ib]; 
    _outState = ic;
  }
  this->Ptype     = ptype;
}
//=============================================================================  
TAutomatDevice::~TAutomatDevice()
{
  
}

//=============================================================================  
Byte TAutomatDevice::GetValue(void)
{
  Byte val = 0;
  Byte aval = 0;
  this->Value = 0;
  if( Ptype->PType == 5 || Ptype->PType == 6)
  {
     Byte cnt = 0;
      if(_inA != NULL && _outA != NULL) if(_inA->GetValue() == 1 && _outA->GetValue() == 1) cnt++;
      if(_inB != NULL && _outB != NULL) if(_inB->GetValue() == 1 && _outB->GetValue() == 1) cnt++;
      if(_inC != NULL && _outC != NULL) if(_inC->GetValue() == 1 && _outC->GetValue() == 1) cnt++;
      switch(_type)
      {
        case 0:
          break;
          
        case 1:
          if( cnt != 1) aval = 1;
          break;
          
        case 2:
          if( cnt != 2) aval = 1;
          break;
          
        case 3:
          if( cnt < 2) aval = 1;
          break;
          
        default:
          break;
      }
      val |=                                aval << 3;
      if(_outA != NULL) val |= _outA->GetValue() << 2; 
      if(_outB != NULL) val |= _outB->GetValue() << 1; 
      if(_outC != NULL) val |= _outC->GetValue(); 
  }
  else if(Ptype->PType == 7)
  {
    if(_inB != NULL) val = _inB->GetValue(); 
  }
  this->Value = val;
  return val;
}
//=============================================================================  
string TAutomatDevice::GetStringValue(void)
{
  string ret = "";

    if( Ptype->PType == 5 || Ptype->PType == 6)
    {
       if(Ptype->PType == 5)
       {
         ret += TBuffer::WordToString( (this->Value >> 3) & 0x01)+',';
       }
       ret += TBuffer::WordToString((this->Value >> 2) & 0x01 )+','+
              TBuffer::WordToString((this->Value >> 1) & 0x01 )+','+
              TBuffer::WordToString( this->Value  & 0x01 )+','+
              TBuffer::WordToString( _parName );
    }
    else if(Ptype->PType == 7)
    {
       ret += TBuffer::WordToString( this->Value )+','+
              TBuffer::WordToString( _parName );
    }
  return ret;
}
//=============================================================================  
string TAutomatDevice::GetStringCfgValue(void)
{
  string ret = "";
     
    if( Ptype->PType == 5 || Ptype->PType == 6)
    {
      if(Ptype->PType == 5)
      {
        if(_inA != NULL) ret += TBuffer::WordToString(_inA->Index)+','; else ret += "0,";
        if(_inB != NULL) ret += TBuffer::WordToString(_inB->Index)+','; else ret += "0,";
        if(_inC != NULL) ret += TBuffer::WordToString(_inC->Index)+','; else ret += "0,";
      }
      if(_outA != NULL) ret += TBuffer::WordToString(_outA->Index)+','; else ret += "0,";
      if(_outB != NULL) ret += TBuffer::WordToString(_outB->Index)+','; else ret += "0,";
      if(_outC != NULL) ret += TBuffer::WordToString(_outC->Index)+','; else ret += "0,";   

      ret += TBuffer::WordToString( _parName );
    }
    else if(Ptype->PType == 7)
    {
       ret += TBuffer::WordToString( _type )+',';
       if(_inB != NULL) ret += TBuffer::WordToString(_inB->Index)+','; else ret += "0,";
       ret += TBuffer::WordToString( _outState )+',';
       ret += TBuffer::WordToString( _parName );
    }
  return ret;
}
//=============================================================================
//=============================================================================  
//*****************************************************************************
//*****************************************************************************
//*****************************************************************************